app/controllers/content_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'Marketing' LIMIT 1
SELECT "contents".* FROM "contents" INNER JOIN "taggings" ON "contents"."id" = "taggings"."content_id" WHERE "taggings"."tag_id" = $1 ORDER BY name asc  [["tag_id", 2]]
SELECT "contents".* FROM "contents" INNER JOIN "taggings" ON "contents"."id" = "taggings"."content_id" WHERE "taggings"."tag_id" = $1 AND "contents"."content_type" = 2 ORDER BY name asc LIMIT 1  [["tag_id", 1]]
---
def index
	if params[:tag].present? and params[:tag] != "Entire"

      filter_tag = Tag.find_by(:name => params[:tag])

    @this_tag = Tag.find_by(:name => params[:tag])
    @content_list = @this_tag.contents
    @content_list = @content_list.order('name asc')
      @section = params[:tag]
    else
      @content_list = Content.all.order('name asc')
      @section = "Entire"

  	end

  if params[:type].present?
    @content_list = @content_list.where(:content_type => params[:type].to_i)

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 11 LIMIT 1
---
def show
	 @content = Content.find_by(:id => params[:content_id])

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 4 LIMIT 1
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 4]]
---
def destroy
	content = Content.find_by(:id => params[:content_id])
    content.destroy

INSERT INTO "contents" ("content_type", "created_at", "desc", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content_type", 1], ["created_at", Sun, 16 Mar 2014 21:34:31 UTC +00:00], ["desc", ""], ["name", ""], ["updated_at", Sun, 16 Mar 2014 21:34:31 UTC +00:00]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = 6 LIMIT 1
INSERT INTO "taggings" ("content_id", "created_at", "tag_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content_id", 28], ["created_at", Sun, 16 Mar 2014 21:13:24 UTC +00:00], ["tag_id", 6], ["updated_at", Sun, 16 Mar 2014 21:13:24 UTC +00:00]]
---
def create
 	content = Content.new
    content.name = params["name"]
    content.desc = params["desc"]

    if !params["image_url"].empty?
	    content.image_url = params["image_url"]
	end
	if !params["article_url"].empty?
    	content.source_url = params["article_url"]
	end
    content.content_type = params["content_type"]
    content.save

    tt = Tagging.new
    tt.content_id = content.id
    s = params["tag"]
    tag = Tag.find_by(id: s.to_i)
    tt.tag_id = tag.id
    tt.save

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 11 LIMIT 1
---
def edit
	 @content = Content.find_by(:id => params[:content_id])

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 13 LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."content_id" = $1 ORDER BY "tags"."id" ASC LIMIT 1  [["content_id", 14]]
SELECT "taggings".* FROM "taggings" WHERE "taggings"."content_id" = $1 ORDER BY "taggings"."id" ASC LIMIT 1  [["content_id", 14]]
UPDATE "contents" SET "source_url" = $1, "updated_at" = $2 WHERE "contents"."id" = 13  [["source_url", "http://www.amazon.com/Kellogg-Strategy-Concepts-Frameworks-Practitioners/dp/0471478555/"], ["updated_at", Sun, 16 Mar 2014 23:52:46 UTC +00:00]]
UPDATE "taggings" SET "tag_id" = $1, "updated_at" = $2 WHERE "taggings"."id" = 14  [["tag_id", nil], ["updated_at", Mon, 17 Mar 2014 03:07:10 UTC +00:00]]
---
def update
	   content = Content.find_by(:id => params[:content_id])

    content.name = params["name"]
    content.desc = params["desc"]
    puts content.desc

    if !params["image_url"].empty?
    	content.image_url = params["image_url"]
	end

	if !params["article_url"].empty?
    	content.source_url = params["article_url"]
    end

    content.content_type = params["content_type"]

    #FIX TAGGING
    if content.tags.first.name != params["tag"]
     puts "I AM IN"
     puts "OLD TAG"+ content.tags.first.name
     puts "NEW TAG"+ params["tag"]
      tagging = content.taggings.first

      t = Tag.find_by(:id => params["tag"])
      tagging.tag_id = t.id
      tagging.save