app/views/content/new.html.erb

       <select name="tag">
         <% Tag.where(:level => 1).each do |t| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."level" = 1