app/views/content/show.html.erb

    <%if @content.tags %>
     <h4>Tags: <%=@content.tags.first.name %> </h4>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."content_id" = $1 ORDER BY "tags"."id" ASC LIMIT 1  [["content_id", 11]]